#Данное Свободное Программное Обеспечение распространяется по лицензии GPL-2.0-only или GPL-2.0-or-later
#Вы имеете право копировать, изменять, распространять, взимать плату за физический акт передачи копии, и вы можете по своему усмотрению предлагать гарантийную защиту в обмен на плату (в случае её распространения), но вы обязаны выкладывать исходный код своей версии программы!
#ДЛЯ ИСПОЛЬЗОВАНИЯ ДАННОГО СВОБОДНОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ - ВАМ НЕ ТРЕБУЕТСЯ ПРИНЯТИЕ ЛИЦЕНЗИИ Gnu GPL v2.0 или более поздней версии.
#В СЛУЧАЕ РАСПРОСТРАНЕНИЯ ОРИГИНАЛЬНОЙ ПРОГРАММЫ И/ИЛИ МОДЕРНИЗИРОВАННОЙ ВЕРСИИ И/ИЛИ ИСПОЛЬЗОВАНИЕ ИСХОДНИКОВ В СВОЕЙ ПРОГРАММЕ - ВЫ ОБЯЗАНЫ ЗАДОКУМЕНТИРОВАТЬ ВСЕ ИЗМЕНЕНИЯ В КОДЕ И ПРЕДОСТАВИТЬ ПОЛЬЗОВАТЕЛЯМ ВОЗМОЖНОСТЬ ПОЛУЧИТЬ ИСХОДНИКИ ВАШЕЙ КОПИИ ПРОГРАММЫ, А ТАКЖЕ УКАЗАТЬ АВТОРСТВО ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ.
#ПРИ РАСПРОСТРАНЕНИИ ПРОГРАММЫ - ВЫ ОБЯЗАНЫ ПРЕДОСТАВИТЬ ВСЕ ТЕЖЕ ПРАВА ПОЛЬЗОВАТЕЛЮ ЧТО ПРЕДОСТАВЛЯЕТ ЛИЦЕНЗИЯ GPL.
#Прочитать полную версию лицензии вы можете по ссылке Фонда Свободного Программного Обеспечения - https://www.gnu.org/licenses/old-licenses/gpl-2.0.html
#Или в файле COPYING в архиве с установщиком программы
#Copyleft 🄯 NEO Organization Departament K 2024 - 2025
#Coded by @AnonimNEO (Telegram)

def CC22(text, cod, decrypt=False):
    result = ""
    new_num = 0

    #Определяем длины алфавитов
    alphabet_lengths = {
        "en_lower": (ord("a"), 26),
        "en_upper": (ord("A"), 26),
        "ru_lower": (ord("а"), 33),
        "ru_upper": (ord("А"), 33)
    }

    #Изменяем смещение в зависимости от операции (шифрование или дешифрование)
    shift_amount = -cod if decrypt else cod

    for char in text: #Обработка Букв
        if char.isalpha():
            if "a" <= char <= "z": #английские буквы (маленькие)
                base, length = alphabet_lengths["en_lower"]
                shifted_char = chr((ord(char) - base + shift_amount) % length + base)
                result += shifted_char

            elif "A" <= char <= "Z": #английские буквы (большие)
                base, length = alphabet_lengths["en_upper"]
                shifted_char = chr((ord(char) - base + shift_amount) % length + base)
                result += shifted_char

            elif "а" <= char <= "я": #русские буквы (маленькие)
                base, length = alphabet_lengths["ru_lower"]
                shifted_char = chr((ord(char) - base + shift_amount) % length + base)
                result += shifted_char

            elif "А" <= char <= "Я": #русские буквы (большие)
                base, length = alphabet_lengths["ru_upper"]
                shifted_char = chr((ord(char) - base + shift_amount) % length + base)
                result += shifted_char

        elif char.isdigit(): #Обработка Чисел
            num = int(char)
            if not decrypt:
                new_num = num * cod
            if decrypt:
                new_num = num / cod
            result += str(new_num)

        else:
            #Если символ не буква и не цифра, добавляем его без изменений
            result += char

    return result