#Данное Свободное Программное Обеспечение распространяется по лицензии GPL-2.0-only или GPL-2.0-or-later
#Вы имеете право копировать, изменять, распространять, взимать плату за физический акт передачи копии, и вы можете по своему усмотрению предлагать гарантийную защиту в обмен на плату (в случае её распространения), но вы обязаны выкладывать исходный код своей версии программы!
#ДЛЯ ИСПОЛЬЗОВАНИЯ ДАННОГО СВОБОДНОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ - ВАМ НЕ ТРЕБУЕТСЯ ПРИНЯТИЕ ЛИЦЕНЗИИ Gnu GPL v2.0 или более поздней версии.
#В СЛУЧАЕ РАСПРОСТРАНЕНИЯ ОРИГИНАЛЬНОЙ ПРОГРАММЫ И/ИЛИ МОДЕРНИЗИРОВАННОЙ ВЕРСИИ И/ИЛИ ИСПОЛЬЗОВАНИЕ ИСХОДНИКОВ В СВОЕЙ ПРОГРАММЕ - ВЫ ОБЯЗАНЫ ЗАДОКУМЕНТИРОВАТЬ ВСЕ ИЗМЕНЕНИЯ В КОДЕ И ПРЕДОСТАВИТЬ ПОЛЬЗОВАТЕЛЯМ ВОЗМОЖНОСТЬ ПОЛУЧИТЬ ИСХОДНИКИ ВАШЕЙ КОПИИ ПРОГРАММЫ, А ТАКЖЕ УКАЗАТЬ АВТОРСТВО ДАННОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ.
#ПРИ РАСПРОСТРАНЕНИИ ПРОГРАММЫ - ВЫ ОБЯЗАНЫ ПРЕДОСТАВИТЬ ВСЕ ТЕЖЕ ПРАВА ПОЛЬЗОВАТЕЛЮ ЧТО ПРЕДОСТАВЛЯЕТ ЛИЦЕНЗИЯ GPL.
#Прочитать полную версию лицензии вы можете по ссылке Фонда Свободного Программного Обеспечения - https://www.gnu.org/licenses/old-licenses/gpl-2.0.html
#Или в файле COPYING в архиве с установщиком программы
#Copyleft 🄯 NEO Organization Departament K 2024 - 2025
#Coded by @AnonimNEO (Telegram)

from tkinter import messagebox, simpledialog
import tkinter as tk
#Логирование Ошибок
from loguru import logger
import random
import os

from RS import random_string

exit_version = "1.0.14 Beta"

dyrachok_path = "C:\\ProgramData\\dyrachok.txt"

try:
    @logger.catch
    def check_access_file():
        try:
            with open(dyrachok_path, "r") as f:
                content = f.read()
            if "debil" in content:
                messagebox.showwarning(random_string(), "Вы смотрите тикток!\nПрограмма не будет закрыта.")
                return False
            else:
                return True
        except FileNotFoundError:
            return True



    @logger.catch
    def tiktok_question():
        if messagebox.askyesno(random_string(), "Смотрите ли вы тикток?"):
            with open(dyrachok_path, "w") as f:
                f.write("debil")
            messagebox.showinfo(random_string(), "Вы смотрите тикток!\nПрограмма не будет закрыта.")
        else:
            logger.info("Завершение Программы...")
            os._exit(0)



    def math_window():
        n = random.randint(256, 1024)
        number_input = tk.simpledialog.askinteger(random_string(), f"Введите результат данного примера: √({n} * {n})")

        if number_input == n:
            tiktok_question()
        else:
            messagebox.showerror(random_string(), "Неправильный ввод капчи.\nПрограмма не будет закрыта.")



    def captcha_window():
        n = random.randint(256, 1024)
        captcha_input = tk.simpledialog.askinteger(random_string(), f"Введите число: {n}")

        if captcha_input == n:
            math_window()
        else:
            messagebox.showerror(random_string(), "Неправильный ввод капчи.\nПрограмма не будет закрыта.")



    def ask_exit():
        if check_access_file():
            if messagebox.askyesno(random_string(), "Вы действительно хотите выйти из данного программного обеспечения?"):
                captcha_window()
            else:
                messagebox.showerror(random_string(), "Данное программное обеспечение не будет закрыто.")

except Exception as e:
    logger.critical(f"В Компоненте Exit произошла неизвестная ошибка!\n{e}")